<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Mengganti Nama Kolom Pada Data Frame Berdasarkan Pola**

---

Import Modules

In [2]:
import pandas as pd
from google.colab import drive

Persiapan Data Frame

In [4]:
drive.mount('/content/drive')
df = pd.read_csv("/content/drive/My Drive/dataset/titanicfull.csv")

df.columns = ['Pclass','Survival status','full Name','Sex ',' Age','Sib SP','Parch','Ticket','Fare','Cabin','Embarked']

df_backup = df.copy(deep=True)
df.head()

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

   Pclass  Survival status  ...    Cabin Embarked
0       1                1  ...       B5        S
1       1                1  ...  C22 C26        S
2       1                0  ...  C22 C26        S
3       1                0  ...  C22 C26        S
4       1                0  ...  C22 C26        S

[5 rows x 11 columns]

Menggunakan Lowercase untuk Nama Kolom dan Mengganti spasi Menjadi ( _ )

In [6]:
#replace berfungsi untuk mengganti karakter
#lower berfungsi untuk mengubah semua huruf menjadi lowercase (huruf kecil)
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

   pclass  survival_status  ...    cabin embarked
0       1                1  ...       B5        S
1       1                1  ...  C22 C26        S
2       1                0  ...  C22 C26        S
3       1                0  ...  C22 C26        S
4       1                0  ...  C22 C26        S

[5 rows x 11 columns]

Memotong Kelebihan Spasi Pada Nama Kolom

In [8]:
#Pertama mengambil data frame yang awal
df = df_backup.copy(deep=True)

#str strip berfungsi memotong kelebihan spasi disisi kiri maupun kanan
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_')
df.head()

   pclass  survival_status  ...    cabin embarked
0       1                1  ...       B5        S
1       1                1  ...  C22 C26        S
2       1                0  ...  C22 C26        S
3       1                0  ...  C22 C26        S
4       1                0  ...  C22 C26        S

[5 rows x 11 columns]